{
    "english": {
        "title": {
            "role": "Front end Engineer",
            "description": "I build accessible, performant interfaces and thoughtful, scalable UI systems."
        },
        "navigation": [
            "Home",
            "Experience",
            "Projects"
        ],
        "update_date": "Last updated: 08.08.2025",
        "profile": "I'm a developer focused on building accessible, performant, and thoughtfully designed user interfaces. I care about structure, clarity, and semantics, and I enjoy turning design systems into clean, maintainable code that works smoothly across devices.<br /><br />Currently, I build front-end architecture and UI components with a strong focus on usability, accessibility, and scalability. I collaborate closely with designers and backend engineers to create reliable and elegant experiences.<br /><br />In past roles, I contributed to academic platforms, internal tools, and public-facing applications, always aiming to bring clarity and consistency to the interface layer. I also take part in product discussions, documentation, and user testing when needed.<br /><br />Outside of work, I enjoy solving puzzles, exploring new frameworks and walking through the city while observing architecture, bits of nature and the quiet rhythm of everyday life.",
        "experience": {
            "section_title": "Experience",
            "items": [
                {
                    "title": "Software Engineer III",
                    "details": "Led the front-end team to streamline delivery processes, improving efficiency by prioritizing backlog and aligning product strategy with business goals. Acted as Product Owner and Designer, introducing new workflows that enhanced product quality and reduced delivery times.",
                    "date": "2025 - Current",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Product Backlog"
                    ]
                },
                {
                    "title": "Research Assistant",
                    "details": "Contributed to a multilingual platform facilitating immigrant integration by providing accessible information on documentation and employment. Led research initiatives and outreach programs, significantly increasing community engagement and awareness.",
                    "date": "2024 - Current",
                    "company": "UniEVANGELICA University",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma",
                        "Accessibility"
                    ]
                },
                {
                    "title": "Software Engineer II",
                    "details": "Drove requirement management and roadmap planning, fostering cross-team collaboration to deliver user-centric features on schedule. Recognized as Best Front-End Developer for elevating the user experience and mentoring peers.",
                    "date": "2024 - 2025",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma"
                    ]
                },
                {
                    "title": "Software Engineer",
                    "details": "Developed internal software solutions aimed at enhancing operational efficiency and system security, ensuring high performance and scalability. Contributed to application documentation, design and handled both front-end and back-end development, delivering intuitive user interfaces and a robust system architecture",
                    "date": "2024",
                    "company": "Brazilian Air Force (FAB)",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Node.js",
                        "MySQL",
                        "Figma"
                    ]
                },
                {
                    "title": "Software Engineer I",
                    "details": "Focused on front-end application development, implementing intuitive interfaces and improving user experience (UX). Utilized modern technologies to ensure responsiveness and accessibility of the systems.",
                    "date": "2023 - 2024",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & CSS",
                        "React"
                    ]
                },
                {
                    "title": "Software Tester",
                    "details": "mproved the reliability of the company's logistics systems by performing thorough functional and exploratory testing in both controlled and real environments. Identified and documented bugs, collaborating closely with the development team to resolve them before release.",
                    "date": "2020 - 2021",
                    "company": "onBlox Logistic Software",
                    "tags": [
                        "Jira",
                        "Scrum"
                    ]
                }
            ],
            "download_resume": "View Full Resume"
        },
        "projects": {
            "section_title": "Projects",
            "main_page": {
                "title": "Projects Archive",
                "table_columns": [
                    "Year",
                    "Project",
                    "Where",
                    "Build",
                    "Link"
                ]
            },
            "items": [
                {
                    "title": "Psicare - Psychiatric Clinic Manager",
                    "details": "Digital platform for managing psychiatric clinic workflows, streamlining appointment scheduling, patient and staff registration, and reporting. Designed to enhance the user experience and improve control, security, and efficiency throughout the clinic.",
                    "date": "2025",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "where": "FTT",
                    "link_title": "Github",
                    "link": "https://github.com/amabilee/psicare-frontend",
                    "tags": [
                        "JavaScript",
                        "React",
                        "RSuite",
                        "MUI"
                    ]
                },
                {
                    "title": "Access Control System",
                    "details": "System for managing secure access to facilities, enabling user authentication, identification badge generation, and detailed tracking of personnel and vehicles. Supports role-based access, real-time entry/exit logging, and alert visualization based on status and CNH validity.",
                    "date": "2025",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/sca-front-end",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Node.js",
                        "Express",
                        "MySQL"
                    ]
                },
                {
                    "title": "Navigation Automation Tool",
                    "details": "A tool for automating navigation tasks by defining and managing sequences of links with customizable intervals. The application includes an easy-to-use graphical interface for adding, editing, and managing automations.",
                    "date": "2025",
                    "where": "Personal",
                    "where_link": "",
                    "link": "https://github.com/amabilee/navigation-automation-tool",
                    "link_title": "Github",
                    "tags": [
                        "Python",
                        "Selenium",
                        "PyQt5"
                    ]
                },
                {
                    "title": "Pasteur - Sterilization Clinic Manager",
                    "details": "System for managing sterilization clinic workflows, optimizing material entry/exit, enabling mobile access, streamlining order validation, and supporting users with monitoring and tailored features.",
                    "date": "2024",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/pasteur",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Bootstrap",
                        "Node.js",
                        "Sequelize",
                        "MySQL"
                    ]
                }
            ],
            "view_archive": "View All Projects"
        },
        "credits": "Put together with Figma, Krita and Visual Studio Code. Built from scratch with React.js and SCSS. Text is styled with Habbo and KarenFat."
    },
    "portuguese": {
        "title": {
            "role": "Engenheira de Software Front-end",
            "description": "Construo interfaces acessiveis, performaticas e sistemas de UI escalaveis e bem pensados."
        },
        "navigation": [
            "Inicio",
            "Experiencia",
            "Projetos"
        ],
        "update_date": "Ultima atualizacao: 08.08.2025",
        "profile": "Sou desenvolvedora focada em construir interfaces acessiveis, performaticas e cuidadosamente desenhadas. Prezo pela estrutura, clareza e semantica, e gosto de transformar sistemas de design em codigo limpo e sustentavel que funciona bem em diferentes dispositivos.<br /><br />Atualmente, desenvolvo arquitetura front-end e componentes de UI com foco forte em usabilidade, acessibilidade e escalabilidade. Trabalho em colaboracao proxima com designers e engenheiros backend para criar experiencias confiaveis e elegantes.<br /><br />Em experiencias anteriores, contribui com plataformas academicas, ferramentas internas e aplicacoes para o publico, sempre buscando trazer clareza e consistencia a camada de interface. Tambem participo de discussoes de produto, documentacao e testes de usabilidade quando necessario.<br /><br />Fora do trabalho, gosto de resolver quebra-cabecas, explorar novos frameworks e caminhar pela cidade observando arquitetura, pedacos da natureza e o ritmo tranquilo do cotidiano.",
        "experience": {
            "section_title": "Experiencia",
            "items": [
                {
                    "title": "Engenheira de Software III",
                    "details": "Liderei a equipe front-end para otimizar processos de entrega, melhorando eficiencia ao priorizar backlog e alinhar estrategia do produto aos objetivos de negocio. Atuei como Product Owner e Designer, introduzindo novos fluxos que elevaram a qualidade do produto e reduziram prazos.",
                    "date": "2025 - Atual",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Gerenciamento de Backlog"
                    ]
                },
                {
                    "title": "Assistente de Pesquisa",
                    "details": "Contribui para plataforma multilingue que facilita a integracao de imigrantes, fornecendo informacoes acessiveis sobre documentacao e emprego. Liderei iniciativas de pesquisa e programas de divulgacao, aumentando significativamente o engajamento e a conscientizacao da comunidade.",
                    "date": "2024 - Atual",
                    "company": "Universidade UniEVANGELICA",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma",
                        "Acessibilidade"
                    ]
                },
                {
                    "title": "Engenheira de Software II",
                    "details": "Gerenciei requisitos e planejamento de roadmap, promovendo colaboracao entre equipes para entregar funcionalidades centradas no usuario dentro do prazo. Reconhecida como Melhor Desenvolvedora Front-End por aprimorar a experiencia do usuario e orientar colegas.",
                    "date": "2024 - 2025",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma"
                    ]
                },
                {
                    "title": "Engenheira de Software",
                    "details": "Desenvolvi solucoes internas para aumentar eficiencia operacional e seguranca do sistema, garantindo alta performance e escalabilidade. Contribui com documentacao, design e desenvolvimento full-stack, entregando interfaces intuitivas e arquitetura robusta.",
                    "date": "2024",
                    "company": "Forca Aerea Brasileira (FAB)",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Node.js",
                        "MySQL",
                        "Figma"
                    ]
                },
                {
                    "title": "Engenheira de Software I",
                    "details": "Foquei no desenvolvimento front-end, implementando interfaces intuitivas e melhorando a experiencia do usuario (UX). Utilizei tecnologias modernas para garantir responsividade e acessibilidade dos sistemas.",
                    "date": "2023 - 2024",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & CSS",
                        "React"
                    ]
                },
                {
                    "title": "Testadora de Software",
                    "details": "Melhorei a confiabilidade dos sistemas logisticos da empresa realizando testes funcionais e exploratorios em ambientes controlados e reais. Identifiquei e documentei bugs, colaborando com a equipe de desenvolvimento para garantir resolucao antes do lancamento.",
                    "date": "2020 - 2021",
                    "company": "onBlox Software Logistico",
                    "tags": [
                        "Jira",
                        "Scrum"
                    ]
                }
            ],
            "download_resume": "Ver Curriculo Completo"
        },
        "projects": {
            "section_title": "Projetos",
            "main_page": {
                "title": "Arquivo de Projetos",
                "table_columns": [
                    "Ano",
                    "Projeto",
                    "Local",
                    "Tecnologias",
                    "Link"
                ]
            },
            "items": [
                {
                    "title": "Psicare - Gerenciador de Clinica Psiquiatrica",
                    "details": "Plataforma digital para gestao de fluxos em clinica psiquiatrica, simplificando agendamento, cadastro de pacientes e funcionarios, e geracao de relatorios. Focada em melhorar experiencia, seguranca e eficiencia operacional.",
                    "date": "2025",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "where": "FTT",
                    "link_title": "Github",
                    "link": "https://github.com/amabilee/psicare-frontend",
                    "tags": [
                        "JavaScript",
                        "React",
                        "RSuite",
                        "MUI"
                    ]
                },
                {
                    "title": "Sistema de Controle de Acesso",
                    "details": "Sistema para gerenciamento seguro de acesso a instalacoes, com autenticacao de usuarios, permissoes por funcao, geracao automatica de crachas e rastreamento em tempo real de pessoas e veiculos. Inclui visualizacao de alertas conforme status e validade da CNH.",
                    "date": "2025",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/sca-front-end",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Node.js",
                        "Express",
                        "MySQL"
                    ]
                },
                {
                    "title": "Ferramenta de Automacao de Navegacao",
                    "details": "Ferramenta para automacao de tarefas de navegacao definindo sequencias de links com intervalos customizaveis. Possui interface grafica simples para adicionar, editar e gerenciar automacoes.",
                    "date": "2025",
                    "where": "Pessoal",
                    "where_link": "",
                    "link": "https://github.com/amabilee/navigation-automation-tool",
                    "link_title": "Github",
                    "tags": [
                        "Python",
                        "Selenium",
                        "PyQt5"
                    ]
                },
                {
                    "title": "Pasteur - Gerenciador de Clinica de Esterilizacao",
                    "details": "Sistema para gestao de clinicas de esterilizacao, otimizando entrada e saida de materiais, acesso movel, validacao de pedidos e suporte a usuarios com monitoramento e recursos personalizados.",
                    "date": "2024",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/pasteur",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Bootstrap",
                        "Node.js",
                        "Sequelize",
                        "MySQL"
                    ]
                }
            ],
            "view_archive": "Ver Todos os Projetos"
        },
        "credits": "Montado com Figma, Krita e Visual Studio Code. Construido do zero com React.js e SCSS. Texto estilizado com Habbo e KarenFat."
    },
    "italian": {
        "title": {
            "role": "Ingegnere Front-end",
            "description": "Realizzo interfacce accessibili, performanti e sistemi UI scalabili e ben progettati."
        },
        "navigation": [
            "Home",
            "Esperienza",
            "Progetti"
        ],
        "update_date": "Ultimo aggiornamento: 08.08.2025",
        "profile": "Sono una sviluppatrice focalizzata sulla costruzione di interfacce utente accessibili, performanti e progettate con cura. Do importanza a struttura, chiarezza e semantica, e mi piace trasformare sistemi di design in codice pulito e manutenibile che funziona perfettamente su diversi dispositivi.<br /><br />Attualmente, sviluppo architetture front-end e componenti UI con un forte focus su usabilita, accessibilita e scalabilita. Collaboro strettamente con designer e ingegneri backend per creare esperienze affidabili ed eleganti.<br /><br />In ruoli precedenti, ho contribuito a piattaforme accademiche, strumenti interni e applicazioni pubbliche, sempre puntando a portare chiarezza e coerenza allo strato di interfaccia. Partecipo anche a discussioni di prodotto, documentazione e test utente quando necessario.<br /><br />Fuori dal lavoro, amo risolvere puzzle, esplorare nuovi framework e passeggiare per la citta osservando l'architettura, piccoli dettagli della natura e il ritmo tranquillo della vita quotidiana.",
        "experience": {
            "section_title": "Esperienza",
            "items": [
                {
                    "title": "Ingegnere Software III",
                    "details": "Ho guidato il team front-end per ottimizzare i processi di consegna, migliorando l'efficienza attraverso la prioritizzazione del backlog e l'allineamento della strategia di prodotto con gli obiettivi aziendali. Ho svolto anche il ruolo di Product Owner e Designer, introducendo nuovi flussi di lavoro che hanno elevato la qualità del prodotto e ridotto i tempi di consegna.",
                    "date": "2025 - Presente",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Gestione Backlog"
                    ]
                },
                {
                    "title": "Assistente di Ricerca",
                    "details": "Ho contribuito a una piattaforma multilingue che facilita l'integrazione degli immigrati, fornendo informazioni accessibili su documenti e opportunita di lavoro. Ho guidato iniziative di ricerca e programmi di sensibilizzazione, aumentando significativamente l'impegno e la consapevolezza della comunita.",
                    "date": "2024 - Presente",
                    "company": "Universita UniEVANGELICA",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma",
                        "Accessibilita"
                    ]
                },
                {
                    "title": "Ingegnere Software II",
                    "details": "Ho gestito i requisiti e la pianificazione della roadmap, promuovendo la collaborazione tra i team per fornire funzionalita orientate all'utente entro i tempi previsti. Riconosciuta come Miglior Sviluppatrice Front-End per aver migliorato l'esperienza utente e guidato i colleghi.",
                    "date": "2024 - 2025",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Figma"
                    ]
                },
                {
                    "title": "Ingegnere Software",
                    "details": "Ho sviluppato soluzioni software interne per aumentare l'efficienza operativa e la sicurezza del sistema, garantendo alte prestazioni e scalabilita. Ho contribuito alla documentazione, al design e allo sviluppo full-stack, fornendo interfacce intuitive e architetture robuste.",
                    "date": "2024",
                    "company": "Forza Aerea Brasiliana (FAB)",
                    "tags": [
                        "JavaScript",
                        "HTML & SCSS",
                        "React",
                        "Node.js",
                        "MySQL",
                        "Figma"
                    ]
                },
                {
                    "title": "Ingegnere Software I",
                    "details": "Mi sono concentrata sullo sviluppo front-end, implementando interfacce intuitive e migliorando l'esperienza utente (UX). Ho utilizzato tecnologie moderne per garantire reattivita e accessibilita dei sistemi.",
                    "date": "2023 - 2024",
                    "company": "FTT",
                    "tags": [
                        "JavaScript",
                        "HTML & CSS",
                        "React"
                    ]
                },
                {
                    "title": "Tester Software",
                    "details": "Ho migliorato l'affidabilita dei sistemi logistici aziendali eseguendo test funzionali ed esplorativi in ambienti controllati e reali. Ho identificato e documentato bug, collaborando con il team di sviluppo per assicurare la risoluzione prima del rilascio.",
                    "date": "2020 - 2021",
                    "company": "onBlox Software Logistico",
                    "tags": [
                        "Jira",
                        "Scrum"
                    ]
                }
            ],
            "download_resume": "Visualizza Curriculum Completo"
        },
        "projects": {
            "section_title": "Progetti",
            "main_page": {
                "title": "Archivio Progetti",
                "table_columns": [
                    "Anno",
                    "Progetto",
                    "Dove",
                    "Tecnologie",
                    "Link"
                ]
            },
            "items": [
                {
                    "title": "Psicare - Gestore Clinica Psichiatrica",
                    "details": "Piattaforma digitale per la gestione dei flussi di lavoro di una clinica psichiatrica, semplificando la pianificazione degli appuntamenti, la registrazione di pazienti e personale e la generazione di report. Progettata per migliorare esperienza, sicurezza ed efficienza operativa.",
                    "date": "2025",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "where": "FTT",
                    "link_title": "Github",
                    "link": "https://github.com/amabilee/psicare-frontend",
                    "tags": [
                        "JavaScript",
                        "React",
                        "RSuite",
                        "MUI"
                    ]
                },
                {
                    "title": "Sistema di Controllo Accessi",
                    "details": "Sistema per la gestione sicura degli accessi alle strutture, con autenticazione utente, permessi basati sui ruoli, generazione automatica di badge e tracciamento in tempo reale di persone e veicoli. Include visualizzazione di alert in base allo stato e validita della patente.",
                    "date": "2025",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/sca-front-end",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Node.js",
                        "Express",
                        "MySQL"
                    ]
                },
                {
                    "title": "Strumento di Automazione della Navigazione",
                    "details": "Strumento per automatizzare attivita di navigazione definendo sequenze di link con intervalli personalizzabili. Include un'interfaccia grafica semplice per aggiungere, modificare e gestire le automazioni.",
                    "date": "2025",
                    "where": "Personale",
                    "where_link": "",
                    "link": "https://github.com/amabilee/navigation-automation-tool",
                    "link_title": "Github",
                    "tags": [
                        "Python",
                        "Selenium",
                        "PyQt5"
                    ]
                },
                {
                    "title": "Pasteur - Gestore Clinica di Sterilizzazione",
                    "details": "Sistema per la gestione di cliniche di sterilizzazione, ottimizzando l'entrata e l'uscita dei materiali, l'accesso mobile, la validazione degli ordini e supportando gli utenti con monitoraggio e funzionalita personalizzate.",
                    "date": "2024",
                    "where": "FTT",
                    "where_link": "https://www.linkedin.com/company/ftt-unievangelica/",
                    "link": "https://github.com/amabilee/pasteur",
                    "link_title": "Github",
                    "tags": [
                        "JavaScript",
                        "React",
                        "Bootstrap",
                        "Node.js",
                        "Sequelize",
                        "MySQL"
                    ]
                }
            ],
            "view_archive": "Visualizza Tutti i Progetti"
        },
        "credits": "Realizzato con Figma, Krita e Visual Studio Code. Costruito da zero con React.js e SCSS. Testo stilizzato con Habbo e KarenFat."
    }
}